
&НаСервереБезКонтекста
Процедура ИнициализироватьОчередиНаСервере()
	ИнтеграцияRMQТ2.ИнициализроватьОчереди();
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьОчереди(Команда)
	ИнициализироватьОчередиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Имя ИЗ ИнтеграцияRMQТ2.ПоддерживаемыеДанные() Цикл
		Элементы.Модуль.СписокВыбора.Добавить(Имя,"ИнтеграцияRMQТ2_"+Имя);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьНаСервере(ИмяМодуля,СообщениеОбмена)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СообщениеОбмена);
	Модуль = ИнтеграцияRMQТ2.МодулиТиповДанных().Получить(ИмяМодуля);
	Возврат  Модуль.ОбработатьJSON(ЧтениеJSON);
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	Если ЗначениеЗаполнено(Модуль) Тогда
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СообщениеОбмена);
		Исключение
			ПоказатьПредупреждение(,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),,"Сообщение должно быть в формате JSON");
			Возврат;
		КонецПопытки;	
		Ссылка = ЗагрузитьНаСервере(Модуль,СообщениеОбмена);
		Если Ссылка =  Неопределено Тогда
			ПоказатьОповещениеПользователя("Выполнено","Сообщение обработано, но его обработка не привела к созданию или изменеию данных");
		Иначе	
			ПоказатьОповещениеПользователя(""+Ссылка,ПолучитьНавигационнуюСсылку(Ссылка),"Сообщение обработано. Создан или получен объект, при нажатии будет открыта ссылка");
		КонецЕсли;	
	Иначе
		ПоказатьПредупреждение(,"Выберите модуль",10,"RMQТ2");
	КонецЕсли;	
КонецПроцедуры
	
