/////// ОПИСАНИЕ
// МОДУЛЬ ПОДРАЗДЕЛЕНИЙ

//  ПРИ КОПИРОВАНИИ МОДУЛЯ 
//	1. Изменения параматров точки обмена ПолучитьТочкуОбмена(), 	Проверка Имени, Корректировака Наименования
// 	2. Изменения параматров очереди ИнициализироватьОчереди(),  	Корректировка Ключа, формирующего имя очереди
//	3. Изменить ключевой элемент в ОбработатьJSON()
//	4. Добавить окончание модуля в ИнтеграцияRMQ.ПоддерживаемыеДанные()
//	5. Заменить Менеджера объекта в функции Менеджер()
//	6. Проверить использование необходимых зависимостей Зависимости()
//	7. Скорректировать описания в комментариях начала модуля
//  8. Отменить экспорт процедуры ПолучитьДанные()

//  ПРИ ВНЕДРЕНИИ
//	1. Проверка функции ЗаполнитьОбъект 
//	2. Возможно переопределение функции ПолучитьОбъект
//	3. Отладка формата сообщений использованием обработки ИнтеграцияRMQОтладка e1cib/app/Обработка.ИнтеграцияRMQОтладка
//	4. Публикация процедуры ПолучитьДанные (указываем конструкцию ЭКСПОРТ) 


#Область Переопределяемыефункции

Функция ПолучитьТочкуОбмена(ОкончаниеМодуля) 
	
	Параметры = Новый Структура;
	Параметры.Вставить("Тип", Перечисления.ИнтеграцияRMQТипТочкиОбмена.topic);
	Параметры.Вставить("Durable", Истина);
	Параметры.Вставить("Имя", "adm."+ОкончаниеМодуля);  			//Проверить при копировании
	Параметры.Вставить("Наименование", "Подразделение линейное");   //Заменить при копировании при необходимости
	
	Результат = ИнтеграцияRMQТ2.ТочкаОбмена(Параметры);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьДанные1(Сообщение, ПараметрыСообщения, Результат) Экспорт  //публикацию включаем после того как выполнена отладка с помошью обработки ИнтеграцияRMQОтладка
	
	МенеджерЗаписи = РегистрыСведений.удалитьЛогПринятых.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УникальныйИдентификатор = Новый УникальныйИдентификатор;
	МенеджерЗаписи.ДатаПолучения = ТекущаяДатаСеанса();
	МенеджерЗаписи.ДанныеСообщения = Сообщение;
	МенеджерЗаписи.Записать();
	
КонецФункции

Функция ПолучитьДанные2(Сообщение, ПараметрыСообщения, Результат)   //публикацию включаем после того как выполнена отладка с помошью обработки ИнтеграцияRMQОтладка
	
КонецФункции

#КонецОбласти


#Область ВспомогательныеПроцедурыФункции

#КонецОбласти
