#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьПривилегированныйРежим(Истина);
 	Пароль = ИнтеграцияRMQ.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка);
 	УстановитьПривилегированныйРежим(Ложь);	
	Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтаФорма.УникальныйИдентификатор, "");
 	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПарольИзменен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ИнтеграцияRMQ.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, Пароль);
		УстановитьПривилегированныйРежим(Ложь);
		Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтаФорма.УникальныйИдентификатор, "");
		
	КонецЕсли;
 	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
 	
	ПарольИзменен = Истина;

КонецПроцедуры
 
#КонецОбласти